In [1]:
import pandas as pd

In [2]:
data = pd.read_excel('dataset/data3.xlsx')

In [3]:
data.shape

(3000, 6)

In [4]:
data.dtypes

id              int64
gender         object
age           float64
edu            object
custom_amt     object
order_date     object
dtype: object

In [5]:
# 数值型转字符型
data['id'] = data['id'].astype(str)
# 字符类型转数值型
data['custom_amt'] = data['custom_amt'].str[1:].astype(float)
# 字符型转日期型
data['order_date'] = pd.to_datetime(data['order_date'],format='%Y年%m月%d日')
# 重新查看数据的变量类型
data.dtypes

id                    object
gender                object
age                  float64
edu                   object
custom_amt           float64
order_date    datetime64[ns]
dtype: object

In [6]:
data.head()

     id  gender   age  edu  custom_amt order_date
0   890  female  43.0  NaN     2177.94 2018-12-25
1  2391    male  52.0  NaN     2442.18 2017-05-24
2  2785    male  39.0  NaN      849.79 2018-05-15
3  1361  female  26.0  NaN     2482.22 2018-05-16
4   888  female  61.0   本科     2027.90 2018-01-21

In [7]:
# 判断数据中是否存在重复观测,可以使用drop_duplicates方法将冗余信息删除
data.duplicated().any()

False

duplicated“方法”和drop_duplicates“方法”都有一个非常重要的参数，就是subset。默认情况下不设置该参数时，表示对数据的所有列进行重复性判断；如果需要按指定的变量做数据的重复性判断时，就可以使用该参数指定具体的变量列表。

In [8]:
# 构造数据
df = pd.DataFrame(dict(name=['张三', '李四', '王二', '张三', '赵五', '丁一', '王二'],
                       gender=['男', '男', '女', '男', '女', '女', '男'],
                       age=[29, 25, 27, 29, 21, 22, 27],
                       income=[15600, 14000, 18500,
                               15600, 10500, 18000, 13000],
                       edu=['本科', '本科', '硕士', '本科', '大专', '本科', '硕士']))
# 查看数据
df

  name gender  age  income edu
0   张三      男   29   15600  本科
1   李四      男   25   14000  本科
2   王二      女   27   18500  硕士
3   张三      男   29   15600  本科
4   赵五      女   21   10500  大专
5   丁一      女   22   18000  本科
6   王二      男   27   13000  硕士

In [9]:
# 默认情况下，对数据的所有变量进行判断
df.drop_duplicates()

  name gender  age  income edu
0   张三      男   29   15600  本科
1   李四      男   25   14000  本科
2   王二      女   27   18500  硕士
4   赵五      女   21   10500  大专
5   丁一      女   22   18000  本科
6   王二      男   27   13000  硕士

In [10]:
df.drop_duplicates(subset=['name','age'])

  name gender  age  income edu
0   张三      男   29   15600  本科
1   李四      男   25   14000  本科
2   王二      女   27   18500  硕士
4   赵五      女   21   10500  大专
5   丁一      女   22   18000  本科